tap "heroku/brew"
tap "hmarr/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "kunichiko/tap"
tap "rhysd/hgrep", "https://github.com/rhysd/hgrep"
tap "stripe/stripe-cli"
# Automate deployment, configuration, and upgrading
brew "ansible"
# GNU multiple precision arithmetic library
brew "gmp"
# General-purpose scripting language
brew "php"
# Dependency Manager for PHP
brew "composer"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Top-like interface for container metrics
brew "ctop"
# Diff that understands syntax
brew "difftastic"
# Secure communications between a client and a DNS resolver
brew "dnscrypt-proxy"
# Bash, Zsh and Fish completion for Docker
brew "docker-completion"
# Minify and secure Docker images
brew "docker-slim"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Command-line tools for fly.io services
brew "flyctl"
# Remote repository management made easy
brew "ghq"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Improved top (interactive process viewer)
brew "htop"
# Language Server for the Lua language
brew "lua-language-server"
# Language Server Protocol for Markdown
brew "marksman"
# Mac App Store command-line interface
brew "mas"
# Easily rename multiple files using your text editor
brew "massren"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Time command execution over multiple executions
brew "multitime"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# App source + Nix packages + Docker = Image
brew "nixpacks"
# Outputs current CPU temperature for OSX
brew "osx-cpu-temp"
# Simplistic interactive filtering tool
brew "peco"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Wrapper around ripgrep that adds multiple rich file types
brew "ripgrep-all"
# Fast, configurable, shell plugin manager
brew "sheldon"
# SMART hard drive monitoring
brew "smartmontools"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Homebrew, but with Docker images
brew "whalebrew"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
brew "kunichiko/tap/mono2stereo"
# hgrep is grep with human-friendly search output
brew "rhysd/hgrep/hgrep"
# Stripe CLI utility
brew "stripe/stripe-cli/stripe"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Password manager that keeps all passwords secure behind one password
cask "1password@7"
# Menu bar tool to limit maximum charging percentage
cask "aldente"
# Android SDK component
cask "android-platform-tools"
# Application uninstaller
cask "appcleaner"
# Chromium based browser
cask "arc"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Virtual Audio Driver
cask "blackhole-2ch"
# Free app that makes your Internet safer
cask "cloudflare-warp"
# Server and cloud storage browser
cask "cyberduck"
# Utility for customizing which browser to start
cask "finicky"
# Web browser
cask "firefox"
# Web browser
cask "firefox@developer-edition"
cask "font-udev-gothic-nf"
# Desktop client for GitHub repositories
cask "github"
# Neovim GUI written in Golang, using a Golang qt backend
cask "goneovim"
# File archiver
cask "keka"
# Find shortcuts for any installed application
cask "keyclu"
# Free and open-source RSS reader
cask "netnewswire"
# Replacement for Docker Desktop
cask "orbstack"
# Minecraft launcher
cask "prismlauncher"
# Quick Look generator for Markdown files
cask "qlmarkdown"
# All-in-one bookmark manager
cask "raindropio"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# File sync and share software
cask "resilio-sync"
# Plugin for AWS CLI to start and end sessions that connect to managed instances
cask "session-manager-plugin"
# Video chat, voice call and instant messaging application
cask "skype"
# Video game digital distribution service
cask "steam"
# Native GUI tool for relational databases
cask "tableplus"
# Utility to hide the notch
cask "topnotch"
# Tiny process monitor
cask "vitals"
# Multimedia player
cask "vlc"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# WordPress local development environment
cask "wordpresscom-studio"
# Comic reader
cask "yacreader"
# Gecko based web browser
cask "zen-browser"
# OpenJDK distribution from Azul
cask "zulu@17"
# OpenJDK distribution from Azul
cask "zulu@8"
mas "1Blocker", id: 1365531024
mas "Apple Configurator", id: 1037126344
mas "Developer", id: 640199958
mas "DNSecure", id: 1533413232
mas "Ginger - Skip Ads", id: 1555702394
mas "Hidden Bar", id: 1452453066
mas "Integrity", id: 513610341
mas "Keynote", id: 409183694
mas "Keyword Search", id: 1558453954
mas "Numbers", id: 409203825
mas "Playgrounds", id: 1496833156
mas "Refined GitHub", id: 1519867270
mas "RetinaCapture", id: 6472719286
mas "RunCat", id: 1429033973
mas "Save to Raindrop.io", id: 1549370672
mas "SEOSpyder", id: 648917964
mas "SVGViewer", id: 1239167834
mas "Tunacan", id: 1594063111
mas "URL Linker", id: 1289119450
mas "VisBug", id: 1538509686
mas "Wappalyzer - Technology profiler", id: 1520333300
mas "WireGuard", id: 1451685025
